/* 

 idmpins - A utility for dumping INS position data

 Copyright (c) 2007 Irig106.org

 All rights reserved.

 Redistribution and use in source and binary forms, with or without 
 modification, are permitted provided that the following conditions are 
 met:

   * Redistributions of source code must retain the above copyright 
     notice, this list of conditions and the following disclaimer.

   * Redistributions in binary form must reproduce the above copyright 
     notice, this list of conditions and the following disclaimer in the 
     documentation and/or other materials provided with the distribution.

   * Neither the name Irig106.org nor the names of its contributors may 
     be used to endorse or promote products derived from this software 
     without specific prior written permission.

 This software is provided by the copyright holders and contributors 
 "as is" and any express or implied warranties, including, but not 
 limited to, the implied warranties of merchantability and fitness for 
 a particular purpose are disclaimed. In no event shall the copyright 
 owner or contributors be liable for any direct, indirect, incidental, 
 special, exemplary, or consequential damages (including, but not 
 limited to, procurement of substitute goods or services; loss of use, 
 data, or profits; or business interruption) however caused and on any 
 theory of liability, whether in contract, strict liability, or tort 
 (including negligence or otherwise) arising in any way out of the use 
 of this software, even if advised of the possibility of such damage.

 Created by Bob Baggerman

*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include <math.h>
#include <assert.h>

#include "config.h"
#include "stdint.h"
#include "irig106ch10.h"

#include "i106_time.h"
#include "i106_decode_time.h"
#include "i106_decode_1553f1.h"
#include "i106_decode_tmats.h"


/*
 * Macros and definitions
 * ----------------------
 */

#define MAJOR_VERSION  "01"
#define MINOR_VERSION  "02"

#if !defined(bTRUE)
#define bTRUE   (1==1)
#define bFALSE  (1==0)
#endif

#define PREEGI_INS_SA_POSITION      27
#define PREEGI_INS_SA_ATTITUDE      25

#if !defined(__GNUC__)
#define M_PI        3.14159265358979323846
#define M_PI_2      1.57079632679489661923
#define M_PI_4      0.785398163397448309616
#endif

#define DEG_TO_RAD(angle)     ((angle)*M_PI/180.0)
#define RAD_TO_DEG(angle)     ((angle)*180.0/M_PI)
#define FT_TO_METERS(ft)      ((ft)*0.3048)
#define METERS_TO_FT(meters)  ((meters)/0.3048)
#define SQUARED(value)        ((value)*(value))
#define CUBED(value)          ((value)*(value)*(value))

/*
 * Data structures
 * ---------------
 */

typedef struct {
  unsigned         uWordCnt    : 5;    /* Data Word Count or Mode Code      */
  unsigned         uSubAddr    : 5;    /* Subaddress Specifier              */
  unsigned         bTR         : 1;    /* Transmit/Receive Flag             */
  unsigned         uRTAddr     : 5;    /* RT Address                        */
  } SuCmd1553;


// F-16/C-130/A-10 EGI

typedef struct INS_DataS {
  unsigned short   uStatus;            /*  1 */
  unsigned short   uTimeTag;           /*  2 */
           short   sVelX_MSW;          /*  3 */
  unsigned short   uVelX_LSW;          /*  4 */
           short   sVelY_MSW;          /*  5 */
  unsigned short   uVelY_LSW;          /*  6 */
           short   uVelZ_MSW;          /*  7 */
  unsigned short   uVelZ_LSW;          /*  8 */
  unsigned short   uAz;                /*  9 */
           short   sRoll;              /* 10 */
           short   sPitch;             /* 11 */
  unsigned short   uTrueHeading;       /* 12 */
  unsigned short   uMagHeading;        /* 13 */
           short         :  5;         /* 14 */
           short   sAccX : 11;         /* 14 */
           short         :  5;         /* 15 */
           short   sAccY : 11;         /* 15 */
           short         :  5;         /* 16 */
           short   sAccZ : 11;         /* 16 */
           short   sCXX_MSW;           /* 17 */
  unsigned short   uCXX_LSW;           /* 18 */
           short   sCXY_MSW;           /* 19 */
  unsigned short   uCXY_LSW;           /* 20 */
           short   sCXZ_MSW;           /* 21 */
  unsigned short   uCXZ_LSW;           /* 22 */
           short   sLon_MSW;           /* 23 */
  unsigned short   uLon_LSW;           /* 24 */
           short   sAlt;               /* 25 */
           short   sSteeringError;     /* 26 */
           short   sTiltX;             /* 27 */
           short   sTiltY;             /* 28 */
           short   sJustInCase[4];     /* 29-32 */
  } SuINS_Data;

// F-15

typedef struct INS_F15_DataS {
  unsigned short   uStatus;            // I_INS_AMX.MSG.M01.INS_STATUS
                                       //  0 - POSITION_AND_VELOCITY_VALID
                                       //  1 - ATTITUDE_VALID
                                       //  2 - BATTERY_VALID
                                       //  3 - TIME_TAG_CLOCK_VALID
                                       //  4 - BARO_INERTIAL_ALTITUDE_VALID
                                       //  5 - BIT_ACKNOWLEDGE
                                       //  6 - DEGRADED_NAV
                                       //  7 - KALMAN_FILTER_BACKGROUND_BUSY
                                       //  8 - KALMAN_FILTER_UPDATE_COMPLETE
                                       //  9 - KALMAN_FILTER_UPDATE_REJECTED
